package bottg

const supportText = "При возникновении ошибок в работе бота, пожалуйста, напиши @gevorg_tsat."

const chooseActionText = "Выберите действие через /start"

const getEmailText = "Отлично, %s! Введи, пожалуйста, свою почту:"

const adminApprovedUserText = "✅ Пользователь подтверждён."
const adminRejectUserText = "❌ Пользователь отклонён."

const userOnboardApproveText = "🎉 Твой онбординг подтверждён!"
const userOnboardRejectText = "❌ Администратор отклонил онбординг."

const incorrectEmailText = "Неправильный формат почты, попробуйте ещё раз."
const emailCheckText = "Вы указали почту(ы): %s %s. Верно? (Да/Нет)"
const checkEmailText = "Пожалуйста, проверь почту — должно прийти два письма с приглашениями. Если не пришло или пришло одно, загляни в «Спам»."

const instructionsForMM = "Инструкция для настройки Mattermost: https://outline.armenianclub.org/s/9814ee83-3a0e-4e7d-872f-c767d2216558"
const instructionsForGD = "Инструкция для настройки Google Drive: https://outline.armenianclub.org/s/30b3026a-b656-4b1f-9415-d775effdcf22"

const userWantOnboardText = "Пользователь @%s хочет пройти онбординг"
